ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2351/device/Reg/spi5_reg.h
     * |        |          |In Slave mode and the FIFO bit is disabled, if the receive PDMA is enabled but the transmit PDMA is disabled, the minimal suspend interval between two successive transactions input is need to be larger than 9 SPI peripheral clock + 4 APB clock for edge mode and 9.5 SPI peripheral clock + 4 APB clock
     * |[2]     |PDMARST   |PDMA Reset
     * |        |          |It is used to reset the SPI PDMA function into default state.
     * |        |          |0 = After reset PDMA function or in normal operation.
     * |        |          |1 = Reset PDMA function.
     * |        |          |Note: It is auto cleared to 0 after the reset function has done.
     * @var SPI5_T::FIFOCTL
     * Offset: 0x3C  SPI FIFO Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |RXFBCLR   |Receive FIFO Buffer Clear
     * |        |          |0 = No clear the received FIFO.
     * |        |          |1 = Clear the received FIFO.
     * |        |          |Note: This bit is used to clear the receiver counter in FIFO Mode
     * |        |          |This bit can be written 1 to clear the receiver counter and this bit will be cleared to 0 automatically after clearing receiving counter
     * |        |          |After the clear operation, the flag of RXEMPTY in SPI_STATUS[0] will be set to 1.
     * |[1]     |TXFBCLR   |Transmit FIFO Buffer Clear
     * |        |          |0 = Not clear the transmitted FIFO.
     * |        |          |1 = Clear the transmitted FIFO.
     * |        |          |Note: This bit is used to clear the transmit counter in FIFO Mode
     * |        |          |This bit can be written 1 to clear the transmitting counter and this bit will be cleared to 0 automatically after clearing transmitting counter
     * |        |          |After the clear operation, the flag of TXEMPTY in SPI_STATUS[2] will be set to 1.
     * |[2]     |RXTHIEN   |Receive Threshold Interrupt Enable Bit
     * |        |          |0 = RX threshold interrupt Disabled.
     * |        |          |1 = RX threshold interrupt Enabled.
     * |[3]     |TXTHIEN   |Transmit Threshold Interrupt Enable Bit
     * |        |          |0 = TX threshold interrupt Disabled.
     * |        |          |1 = TX threshold interrupt Enabled.
     * |[4]     |RXOVIEN   |Receive FIFO Overrun Interrupt Enable Bit
     * |        |          |0 = RX FIFO overrun interrupt Disabled.
     * |        |          |1 = RX FIFO overrun interrupt Enabled.
     * |[7]     |RXTOIEN   |RX Read Time Out Interrupt Enable Bit
     * |        |          |0 = RX read Timeout Interrupt Disabled.
     * |        |          |1 = RX read Timeout Interrupt Enabled.
     * |[26:24] |RXTH      |Received FIFO Threshold
     * |        |          |If RX valid data counts are larger than RXTH, RXTHIF (SPI_STATUS[8]) will be set to 1..
     * |[30:28] |TXTH      |Transmit FIFO Threshold
     * |        |          |If TX valid data counts are less than or equal to TXTH, TXTHIF (SPI_STATUS[10]) will be set to 1.
     */
    __IO uint32_t CTL;                   /*!< [0x0000] SPI Control Register                                             */
    __IO uint32_t STATUS;                /*!< [0x0004] SPI Status Register                                              */
    __IO uint32_t CLKDIV;                /*!< [0x0008] SPI Clock Divider Register                                       */
    __IO uint32_t SSCTL;                 /*!< [0x000c] SPI Slave Select Control Register                                */
    __I  uint32_t RX;                    /*!< [0x0010] SPI Receive Data FIFO Register                                   */
    __I  uint32_t RESERVE0[3];
    __O  uint32_t TX;                    /*!< [0x0020] SPI Transmit Data FIFO Register                                  */
    __I  uint32_t RESERVE1[5];
    __IO uint32_t PDMACTL;               /*!< [0x0038] SPI PDMA Control Register                                        */
    __IO uint32_t FIFOCTL;               /*!< [0x003c] SPI FIFO Control Register                                        */

} SPI5_T;

/**
    @addtogroup SPI5_CONST SPI5 Bit Field Definition
    Constant Definitions for SPI5 Controller
@{ */

#define SPI5_CTL_GOBUSY_Pos              (0)                                               /*!< SPI5_T::CTL: GOBUSY Position           */
#define SPI5_CTL_GOBUSY_Msk              (0x1ul << SPI5_CTL_GOBUSY_Pos)                    /*!< SPI5_T::CTL: GOBUSY Mask               */

#define SPI5_CTL_RXNEG_Pos               (1)                                               /*!< SPI5_T::CTL: RXNEG Position            */
#define SPI5_CTL_RXNEG_Msk               (0x1ul << SPI5_CTL_RXNEG_Pos)                     /*!< SPI5_T::CTL: RXNEG Mask                */

#define SPI5_CTL_TXNEG_Pos               (2)                                               /*!< SPI5_T::CTL: TXNEG Position            */
#define SPI5_CTL_TXNEG_Msk               (0x1ul << SPI5_CTL_TXNEG_Pos)                     /*!< SPI5_T::CTL: TXNEG Mask                */

#define SPI5_CTL_DWIDTH_Pos              (3)                                               /*!< SPI5_T::CTL: DWIDTH Position           */
#define SPI5_CTL_DWIDTH_Msk              (0x1ful << SPI5_CTL_DWIDTH_Pos)                   /*!< SPI5_T::CTL: DWIDTH Mask               */

#define SPI5_CTL_LSB_Pos                 (10)                                              /*!< SPI5_T::CTL: LSB Position              */
#define SPI5_CTL_LSB_Msk                 (0x1ul << SPI5_CTL_LSB_Pos)                       /*!< SPI5_T::CTL: LSB Mask                  */

#define SPI5_CTL_CLKPOL_Pos              (11)                                              /*!< SPI5_T::CTL: CLKPOL Position           */
#define SPI5_CTL_CLKPOL_Msk              (0x1ul << SPI5_CTL_CLKPOL_Pos)                    /*!< SPI5_T::CTL: CLKPOL Mask               */

#define SPI5_CTL_SUSPITV_Pos             (12)                                              /*!< SPI5_T::CTL: SUSPITV Position          */
#define SPI5_CTL_SUSPITV_Msk             (0xful << SPI5_CTL_SUSPITV_Pos)                   /*!< SPI5_T::CTL: SUSPITV Mask              */

