ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2351/device/Reg/spi5_reg.h
#define SPI5_CTL_UNITIEN_Pos             (17)                                              /*!< SPI5_T::CTL: UNITIEN Position          */
#define SPI5_CTL_UNITIEN_Msk             (0x1ul << SPI5_CTL_UNITIEN_Pos)                   /*!< SPI5_T::CTL: UNITIEN Mask              */

#define SPI5_CTL_SLAVE_Pos               (18)                                              /*!< SPI5_T::CTL: SLAVE Position            */
#define SPI5_CTL_SLAVE_Msk               (0x1ul << SPI5_CTL_SLAVE_Pos)                     /*!< SPI5_T::CTL: SLAVE Mask                */

#define SPI5_CTL_REORDER_Pos             (19)                                              /*!< SPI5_T::CTL: REORDER Position          */
#define SPI5_CTL_REORDER_Msk             (0x1ul << SPI5_CTL_REORDER_Pos)                   /*!< SPI5_T::CTL: REORDER Mask              */

#define SPI5_CTL_FIFOM_Pos               (21)                                              /*!< SPI5_T::CTL: FIFOM Position            */
#define SPI5_CTL_FIFOM_Msk               (0x1ul << SPI5_CTL_FIFOM_Pos)                     /*!< SPI5_T::CTL: FIFOM Mask                */

#define SPI5_CTL_WKSSEN_Pos              (30)                                              /*!< SPI5_T::CTL: WKSSEN Position           */
#define SPI5_CTL_WKSSEN_Msk              (0x1ul << SPI5_CTL_WKSSEN_Pos)                    /*!< SPI5_T::CTL: WKSSEN Mask               */

#define SPI5_CTL_WKCLKEN_Pos             (31)                                              /*!< SPI5_T::CTL: WKCLKEN Position          */
#define SPI5_CTL_WKCLKEN_Msk             (0x1ul << SPI5_CTL_WKCLKEN_Pos)                   /*!< SPI5_T::CTL: WKCLKEN Mask              */

#define SPI5_STATUS_RXEMPTY_Pos          (0)                                               /*!< SPI5_T::STATUS: RXEMPTY Position       */
#define SPI5_STATUS_RXEMPTY_Msk          (0x1ul << SPI5_STATUS_RXEMPTY_Pos)                /*!< SPI5_T::STATUS: RXEMPTY Mask           */

#define SPI5_STATUS_RXFULL_Pos           (1)                                               /*!< SPI5_T::STATUS: RXFULL Position        */
#define SPI5_STATUS_RXFULL_Msk           (0x1ul << SPI5_STATUS_RXFULL_Pos)                 /*!< SPI5_T::STATUS: RXFULL Mask            */

#define SPI5_STATUS_TXEMPTY_Pos          (2)                                               /*!< SPI5_T::STATUS: TXEMPTY Position       */
#define SPI5_STATUS_TXEMPTY_Msk          (0x1ul << SPI5_STATUS_TXEMPTY_Pos)                /*!< SPI5_T::STATUS: TXEMPTY Mask           */

#define SPI5_STATUS_TXFULL_Pos           (3)                                               /*!< SPI5_T::STATUS: TXFULL Position        */
#define SPI5_STATUS_TXFULL_Msk           (0x1ul << SPI5_STATUS_TXFULL_Pos)                 /*!< SPI5_T::STATUS: TXFULL Mask            */

#define SPI5_STATUS_LTRIGF_Pos           (4)                                               /*!< SPI5_T::STATUS: LTRIGF Position        */
#define SPI5_STATUS_LTRIGF_Msk           (0x1ul << SPI5_STATUS_LTRIGF_Pos)                 /*!< SPI5_T::STATUS: LTRIGF Mask            */

#define SPI5_STATUS_SLVSTAIF_Pos         (6)                                               /*!< SPI5_T::STATUS: SLVSTAIF Position      */
#define SPI5_STATUS_SLVSTAIF_Msk         (0x1ul << SPI5_STATUS_SLVSTAIF_Pos)               /*!< SPI5_T::STATUS: SLVSTAIF Mask          */

#define SPI5_STATUS_UNITIF_Pos           (7)                                               /*!< SPI5_T::STATUS: UNITIF Position        */
#define SPI5_STATUS_UNITIF_Msk           (0x1ul << SPI5_STATUS_UNITIF_Pos)                 /*!< SPI5_T::STATUS: UNITIF Mask            */

#define SPI5_STATUS_RXTHIF_Pos           (8)                                               /*!< SPI5_T::STATUS: RXTHIF Position        */
#define SPI5_STATUS_RXTHIF_Msk           (0x1ul << SPI5_STATUS_RXTHIF_Pos)                 /*!< SPI5_T::STATUS: RXTHIF Mask            */

#define SPI5_STATUS_RXOVIF_Pos           (9)                                               /*!< SPI5_T::STATUS: RXOVIF Position        */
#define SPI5_STATUS_RXOVIF_Msk           (0x1ul << SPI5_STATUS_RXOVIF_Pos)                 /*!< SPI5_T::STATUS: RXOVIF Mask            */

#define SPI5_STATUS_TXTHIF_Pos           (10)                                              /*!< SPI5_T::STATUS: TXTHIF Position        */
#define SPI5_STATUS_TXTHIF_Msk           (0x1ul << SPI5_STATUS_TXTHIF_Pos)                 /*!< SPI5_T::STATUS: TXTHIF Mask            */

#define SPI5_STATUS_RXTOIF_Pos           (12)                                              /*!< SPI5_T::STATUS: RXTOIF Position        */
#define SPI5_STATUS_RXTOIF_Msk           (0x1ul << SPI5_STATUS_RXTOIF_Pos)                 /*!< SPI5_T::STATUS: RXTOIF Mask            */

#define SPI5_STATUS_SLVTOIF_Pos          (13)                                              /*!< SPI5_T::STATUS: SLVTOIF Position       */
#define SPI5_STATUS_SLVTOIF_Msk          (0x1ul << SPI5_STATUS_SLVTOIF_Pos)                /*!< SPI5_T::STATUS: SLVTOIF Mask           */

#define SPI5_STATUS_SLVTXSKE_Pos         (15)                                              /*!< SPI5_T::STATUS: SLVTXSKE Position      */
#define SPI5_STATUS_SLVTXSKE_Msk         (0x1ul << SPI5_STATUS_SLVTXSKE_Pos)               /*!< SPI5_T::STATUS: SLVTXSKE Mask          */

#define SPI5_STATUS_RXCNT_Pos            (16)                                              /*!< SPI5_T::STATUS: RXCNT Position         */
#define SPI5_STATUS_RXCNT_Msk            (0xful << SPI5_STATUS_RXCNT_Pos)                  /*!< SPI5_T::STATUS: RXCNT Mask             */

#define SPI5_STATUS_TXCNT_Pos            (20)                                              /*!< SPI5_T::STATUS: TXCNT Position         */
#define SPI5_STATUS_TXCNT_Msk            (0xful << SPI5_STATUS_TXCNT_Pos)                  /*!< SPI5_T::STATUS: TXCNT Mask             */

#define SPI5_STATUS_WKSSIF_Pos           (30)                                              /*!< SPI5_T::STATUS: WKSSIF Position        */
#define SPI5_STATUS_WKSSIF_Msk           (0x1ul << SPI5_STATUS_WKSSIF_Pos)                 /*!< SPI5_T::STATUS: WKSSIF Mask            */

