ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_M2351/device/Reg/spi5_reg.h
#define SPI5_STATUS_WKCLKIF_Pos          (31)                                              /*!< SPI5_T::STATUS: WKCLKIF Position       */
#define SPI5_STATUS_WKCLKIF_Msk          (0x1ul << SPI5_STATUS_WKCLKIF_Pos)                /*!< SPI5_T::STATUS: WKCLKIF Mask           */

#define SPI5_CLKDIV_DIVIDER_Pos          (0)                                               /*!< SPI5_T::CLKDIV: DIVIDER Position       */
#define SPI5_CLKDIV_DIVIDER_Msk          (0xfful << SPI5_CLKDIV_DIVIDER_Pos)               /*!< SPI5_T::CLKDIV: DIVIDER Mask           */

#define SPI5_SSCTL_SS_Pos                (0)                                               /*!< SPI5_T::SSCTL: SS Position             */
#define SPI5_SSCTL_SS_Msk                (0x1ul << SPI5_SSCTL_SS_Pos)                      /*!< SPI5_T::SSCTL: SS Mask                 */

#define SPI5_SSCTL_SSACTPOL_Pos          (2)                                               /*!< SPI5_T::SSCTL: SSACTPOL Position       */
#define SPI5_SSCTL_SSACTPOL_Msk          (0x1ul << SPI5_SSCTL_SSACTPOL_Pos)                /*!< SPI5_T::SSCTL: SSACTPOL Mask           */

#define SPI5_SSCTL_AUTOSS_Pos            (3)                                               /*!< SPI5_T::SSCTL: AUTOSS Position         */
#define SPI5_SSCTL_AUTOSS_Msk            (0x1ul << SPI5_SSCTL_AUTOSS_Pos)                  /*!< SPI5_T::SSCTL: AUTOSS Mask             */

#define SPI5_SSCTL_SSLTRIG_Pos           (4)                                               /*!< SPI5_T::SSCTL: SSLTRIG Position        */
#define SPI5_SSCTL_SSLTRIG_Msk           (0x1ul << SPI5_SSCTL_SSLTRIG_Pos)                 /*!< SPI5_T::SSCTL: SSLTRIG Mask            */

#define SPI5_SSCTL_SLV3WIRE_Pos          (5)                                               /*!< SPI5_T::SSCTL: SLV3WIRE Position       */
#define SPI5_SSCTL_SLV3WIRE_Msk          (0x1ul << SPI5_SSCTL_SLV3WIRE_Pos)                /*!< SPI5_T::SSCTL: SLV3WIRE Mask           */

#define SPI5_SSCTL_SLVTOIEN_Pos          (6)                                               /*!< SPI5_T::SSCTL: SLVTOIEN Position       */
#define SPI5_SSCTL_SLVTOIEN_Msk          (0x1ul << SPI5_SSCTL_SLVTOIEN_Pos)                /*!< SPI5_T::SSCTL: SLVTOIEN Mask           */

#define SPI5_SSCTL_SLVABORT_Pos          (8)                                               /*!< SPI5_T::SSCTL: SLVABORT Position       */
#define SPI5_SSCTL_SLVABORT_Msk          (0x1ul << SPI5_SSCTL_SLVABORT_Pos)                /*!< SPI5_T::SSCTL: SLVABORT Mask           */

#define SPI5_SSCTL_SSTAIEN_Pos           (9)                                               /*!< SPI5_T::SSCTL: SSTAIEN Position        */
#define SPI5_SSCTL_SSTAIEN_Msk           (0x1ul << SPI5_SSCTL_SSTAIEN_Pos)                 /*!< SPI5_T::SSCTL: SSTAIEN Mask            */

#define SPI5_SSCTL_SSINAIEN_Pos          (16)                                              /*!< SPI5_T::SSCTL: SSINAIEN Position       */
#define SPI5_SSCTL_SSINAIEN_Msk          (0x1ul << SPI5_SSCTL_SSINAIEN_Pos)                /*!< SPI5_T::SSCTL: SSINAIEN Mask           */

#define SPI5_SSCTL_SLVTOCNT_Pos          (20)                                              /*!< SPI5_T::SSCTL: SLVTOCNT Position       */
#define SPI5_SSCTL_SLVTOCNT_Msk          (0x3fful << SPI5_SSCTL_SLVTOCNT_Pos)              /*!< SPI5_T::SSCTL: SLVTOCNT Mask           */

#define SPI5_RX_RX_Pos                   (0)                                               /*!< SPI5_T::RX: RX Position                */
#define SPI5_RX_RX_Msk                   (0xfffffffful << SPI5_RX_RX_Pos)                  /*!< SPI5_T::RX: RX Mask                    */

#define SPI5_TX_TX_Pos                   (0)                                               /*!< SPI5_T::TX: TX Position                */
#define SPI5_TX_TX_Msk                   (0xfffffffful << SPI5_TX_TX_Pos)                  /*!< SPI5_T::TX: TX Mask                    */

#define SPI5_PDMACTL_TXPDMAEN_Pos        (0)                                               /*!< SPI5_T::PDMACTL: TXPDMAEN Position     */
#define SPI5_PDMACTL_TXPDMAEN_Msk        (0x1ul << SPI5_PDMACTL_TXPDMAEN_Pos)              /*!< SPI5_T::PDMACTL: TXPDMAEN Mask         */

#define SPI5_PDMACTL_RXPDMAEN_Pos        (1)                                               /*!< SPI5_T::PDMACTL: RXPDMAEN Position     */
#define SPI5_PDMACTL_RXPDMAEN_Msk        (0x1ul << SPI5_PDMACTL_RXPDMAEN_Pos)              /*!< SPI5_T::PDMACTL: RXPDMAEN Mask         */

#define SPI5_PDMACTL_PDMARST_Pos         (2)                                               /*!< SPI5_T::PDMACTL: PDMARST Position      */
#define SPI5_PDMACTL_PDMARST_Msk         (0x1ul << SPI5_PDMACTL_PDMARST_Pos)               /*!< SPI5_T::PDMACTL: PDMARST Mask          */

#define SPI5_FIFOCTL_RXFBCLR_Pos         (0)                                               /*!< SPI5_T::FIFOCTL: RXFBCLR Position      */
#define SPI5_FIFOCTL_RXFBCLR_Msk         (0x1ul << SPI5_FIFOCTL_RXFBCLR_Pos)               /*!< SPI5_T::FIFOCTL: RXFBCLR Mask          */

#define SPI5_FIFOCTL_TXFBCLR_Pos         (1)                                               /*!< SPI5_T::FIFOCTL: TXFBCLR Position      */
#define SPI5_FIFOCTL_TXFBCLR_Msk         (0x1ul << SPI5_FIFOCTL_TXFBCLR_Pos)               /*!< SPI5_T::FIFOCTL: TXFBCLR Mask          */

#define SPI5_FIFOCTL_RXTHIEN_Pos         (2)                                               /*!< SPI5_T::FIFOCTL: RXTHIEN Position      */
#define SPI5_FIFOCTL_RXTHIEN_Msk         (0x1ul << SPI5_FIFOCTL_RXTHIEN_Pos)               /*!< SPI5_T::FIFOCTL: RXTHIEN Mask          */

#define SPI5_FIFOCTL_TXTHIEN_Pos         (3)                                               /*!< SPI5_T::FIFOCTL: TXTHIEN Position      */
#define SPI5_FIFOCTL_TXTHIEN_Msk         (0x1ul << SPI5_FIFOCTL_TXTHIEN_Pos)               /*!< SPI5_T::FIFOCTL: TXTHIEN Mask          */

#define SPI5_FIFOCTL_RXOVIEN_Pos         (4)                                               /*!< SPI5_T::FIFOCTL: RXOVIEN Position      */
#define SPI5_FIFOCTL_RXOVIEN_Msk         (0x1ul << SPI5_FIFOCTL_RXOVIEN_Pos)               /*!< SPI5_T::FIFOCTL: RXOVIEN Mask          */

#define SPI5_FIFOCTL_RXTOIEN_Pos         (7)                                               /*!< SPI5_T::FIFOCTL: RXTOIEN Position      */
#define SPI5_FIFOCTL_RXTOIEN_Msk         (0x1ul << SPI5_FIFOCTL_RXTOIEN_Pos)               /*!< SPI5_T::FIFOCTL: RXTOIEN Mask          */

#define SPI5_FIFOCTL_RXTH_Pos            (24)                                              /*!< SPI5_T::FIFOCTL: RXTH Position         */
#define SPI5_FIFOCTL_RXTH_Msk            (0x7ul << SPI5_FIFOCTL_RXTH_Pos)                  /*!< SPI5_T::FIFOCTL: RXTH Mask             */

#define SPI5_FIFOCTL_TXTH_Pos            (28)                                              /*!< SPI5_T::FIFOCTL: TXTH Position         */
#define SPI5_FIFOCTL_TXTH_Msk            (0x7ul << SPI5_FIFOCTL_TXTH_Pos)                  /*!< SPI5_T::FIFOCTL: TXTH Mask             */

/**@}*/ /* SPI5_CONST */
/**@}*/ /* end of SPI5 register group */

#endif /* __SPI5_REG_H__ */
